In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('C:/Users/user/Downloads/Python Problems/Numpy,Pandas &Visualizaation/Files_Dataset/ecommerce_dataset.csv', encoding = 'latin1')

In [3]:
df.head(5)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom

In [4]:
df.tail(5)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,12/9/2011 12:50,0.85,12680.0,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,12/9/2011 12:50,2.10,12680.0,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,12/9/2011 12:50,4.15,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,12/9/2011 12:50,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,12/9/2011 12:50,4.95,12680.0,France

In [5]:
df.sample(frac = 0.5)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
483747,577507,22938,CUPCAKE LACE PAPER SET 6,12,11/20/2011 12:42,1.95,14710.0,United Kingdom
394750,570881,22483,RED GINGHAM TEDDY BEAR,6,10/13/2011 9:30,2.95,12498.0,Germany
413587,572317,22114,HOT WATER BOTTLE TEA AND SYMPATHY,1,10/23/2011 16:13,4.25,14629.0,United Kingdom
442635,574677,23393,HOME SWEET HOME CUSHION COVER,2,11/6/2011 12:32,3.75,16445.0,United Kingdom
11385,537240,16235,RECYCLED PENCIL WITH RABBIT ERASER,1,12/6/2010 10:08,0.43,NaN,United Kingdom
...,...,...,...,...,...,...,...,...
90292,543995,84971S,SMALL HEART FLOWERS HOOK,72,2/15/2011 10:45,0.85,13408.0,United Kingdom
328767,565803,22329,ROUND CONTAINER SET OF 5 RETROSPOT,12,9/7/2011 10:38,1.65,17735.0,United Kingdom
196469,553852,84927F,PSYCHEDELIC TILE HOOK,6,5/19/2011 13:05,2.10,15599.0,United Kingdom
348372,567424,22907,PACK OF 20 NAPKINS PANTRY DESIGN,1,9/20/2011 11:16,0.85,16369.0,United Kingdom
66964,541827,85180B,PINK HEARTS LIGHT CHAIN,1,1/21/2011 17:05,2.46,NaN,United Kingdom

In [6]:
df.shape

(541909, 8)

In [7]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
Quantity,541909.0,9.552250,218.081158,-80995.00,1.00,3.00,10.00,80995.0
UnitPrice,541909.0,4.611114,96.759853,-11062.06,1.25,2.08,4.13,38970.0
CustomerID,406829.0,15287.690570,1713.600303,12346.00,13953.00,15152.00,16791.00,18287.0

In [8]:
df.dtypes

InvoiceNo       object
StockCode       object
Description     object
Quantity         int64
InvoiceDate     object
UnitPrice      float64
CustomerID     float64
Country         object
dtype: object

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  object
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 33.1+ MB

In [10]:
df.iloc[1:10, 2:6]

                           Description  Quantity     InvoiceDate  UnitPrice
1                  WHITE METAL LANTERN         6  12/1/2010 8:26       3.39
2       CREAM CUPID HEARTS COAT HANGER         8  12/1/2010 8:26       2.75
3  KNITTED UNION FLAG HOT WATER BOTTLE         6  12/1/2010 8:26       3.39
4       RED WOOLLY HOTTIE WHITE HEART.         6  12/1/2010 8:26       3.39
5         SET 7 BABUSHKA NESTING BOXES         2  12/1/2010 8:26       7.65
6    GLASS STAR FROSTED T-LIGHT HOLDER         6  12/1/2010 8:26       4.25
7               HAND WARMER UNION JACK         6  12/1/2010 8:28       1.85
8            HAND WARMER RED POLKA DOT         6  12/1/2010 8:28       1.85
9        ASSORTED COLOUR BIRD ORNAMENT        32  12/1/2010 8:34       1.69

In [11]:
df['Description'].value_counts().head(5)

WHITE HANGING HEART T-LIGHT HOLDER    2369
REGENCY CAKESTAND 3 TIER              2200
JUMBO BAG RED RETROSPOT               2159
PARTY BUNTING                         1727
LUNCH BAG RED RETROSPOT               1638
Name: Description, dtype: int64

In [12]:
df['StockCode'].is_unique

False

In [13]:
#check which columns has unique values present in the dataframe
for col in df.columns:
    if df[col].is_unique:
        print(f"{col}: True")
    else:
        print(f"{col}: False")

InvoiceNo: False
StockCode: False
Description: False
Quantity: False
InvoiceDate: False
UnitPrice: False
CustomerID: False
Country: False

In [14]:
df['StockCode'].count()

541909

In [15]:
df['StockCode'].nunique()

4070

In [16]:
df.size

4335272

In [17]:
# gives complete dataframe based on highest to lowest UnitPrice
df.sort_values('UnitPrice', ascending = False)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
222681,C556445,M,Manual,-1,6/10/2011 15:31,38970.00,15098.0,United Kingdom
524602,C580605,AMAZONFEE,AMAZON FEE,-1,12/5/2011 11:36,17836.46,NaN,United Kingdom
43702,C540117,AMAZONFEE,AMAZON FEE,-1,1/5/2011 9:55,16888.02,NaN,United Kingdom
43703,C540118,AMAZONFEE,AMAZON FEE,-1,1/5/2011 9:57,16453.71,NaN,United Kingdom
15017,537632,AMAZONFEE,AMAZON FEE,1,12/7/2010 15:08,13541.33,NaN,United Kingdom
...,...,...,...,...,...,...,...,...
128465,547337,85025C,barcode problem,-230,3/22/2011 11:47,0.00,NaN,United Kingdom
128464,547336,21689,wrong barcode,-323,3/22/2011 11:45,0.00,NaN,United Kingdom
40089,539722,22423,REGENCY CAKESTAND 3 TIER,10,12/21/2010 13:45,0.00,14911.0,EIRE
299984,A563187,B,Adjust bad debt,1,8/12/2011 14:52,-11062.06,NaN,United Kingdom
299983,A563186,B,Adjust bad debt,1,8/12/2011 14:51,-11062.06,NaN,United Kingdom

In [18]:
# find top 10 highest unitprice rows from the dataframe
df.sort_values('UnitPrice', ascending = False).head(10)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
222681,C556445,M,Manual,-1,6/10/2011 15:31,38970.00,15098.0,United Kingdom
524602,C580605,AMAZONFEE,AMAZON FEE,-1,12/5/2011 11:36,17836.46,NaN,United Kingdom
43702,C540117,AMAZONFEE,AMAZON FEE,-1,1/5/2011 9:55,16888.02,NaN,United Kingdom
43703,C540118,AMAZONFEE,AMAZON FEE,-1,1/5/2011 9:57,16453.71,NaN,United Kingdom
15017,537632,AMAZONFEE,AMAZON FEE,1,12/7/2010 15:08,13541.33,NaN,United Kingdom
16356,C537651,AMAZONFEE,AMAZON FEE,-1,12/7/2010 15:49,13541.33,NaN,United Kingdom
15016,C537630,AMAZONFEE,AMAZON FEE,-1,12/7/2010 15:04,13541.33,NaN,United Kingdom
16232,C537644,AMAZONFEE,AMAZON FEE,-1,12/7/2010 15:34,13474.79,NaN,United Kingdom
524601,C580604,AMAZONFEE,AMAZON FEE,-1,12/5/2011 11:35,11586.50,NaN,United Kingdom
299982,A563185,B,Adjust bad debt,1,8/12/2011 14:50,11062.06,NaN,United Kingdom

In [19]:
df.isnull().sum()

InvoiceNo           0
StockCode           0
Description      1454
Quantity            0
InvoiceDate         0
UnitPrice           0
CustomerID     135080
Country             0
dtype: int64

In [20]:
(df == 0).sum()

InvoiceNo         0
StockCode         0
Description       0
Quantity          0
InvoiceDate       0
UnitPrice      2515
CustomerID        0
Country           0
dtype: int64

In [21]:
#fill the description columns with the mode of that column
df['Description'].fillna(df['Description'].mode()[0], inplace = True)

In [22]:
df.isnull().sum()

InvoiceNo           0
StockCode           0
Description         0
Quantity            0
InvoiceDate         0
UnitPrice           0
CustomerID     135080
Country             0
dtype: int64

In [23]:
df.dropna(axis = 0)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,12/9/2011 12:50,0.85,12680.0,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,12/9/2011 12:50,2.10,12680.0,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,12/9/2011 12:50,4.15,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,12/9/2011 12:50,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,12/9/2011 12:50,4.95,12680.0,France

In [24]:
df.dropna(axis = 1)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,United Kingdom
...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,12/9/2011 12:50,0.85,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,12/9/2011 12:50,2.10,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,12/9/2011 12:50,4.15,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,12/9/2011 12:50,4.15,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,12/9/2011 12:50,4.95,France

In [25]:
df.drop_duplicates(subset = ['StockCode', 'InvoiceNo'])

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,12/9/2011 12:50,0.85,12680.0,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,12/9/2011 12:50,2.10,12680.0,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,12/9/2011 12:50,4.15,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,12/9/2011 12:50,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,12/9/2011 12:50,4.95,12680.0,France

In [26]:
df[df.duplicated()]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
517,536409,21866,UNION JACK FLAG LUGGAGE TAG,1,12/1/2010 11:45,1.25,17908.0,United Kingdom
527,536409,22866,HAND WARMER SCOTTY DOG DESIGN,1,12/1/2010 11:45,2.10,17908.0,United Kingdom
537,536409,22900,SET 2 TEA TOWELS I LOVE LONDON,1,12/1/2010 11:45,2.95,17908.0,United Kingdom
539,536409,22111,SCOTTIE DOG HOT WATER BOTTLE,1,12/1/2010 11:45,4.95,17908.0,United Kingdom
555,536412,22327,ROUND SNACK BOXES SET OF 4 SKULLS,1,12/1/2010 11:49,2.95,17920.0,United Kingdom
...,...,...,...,...,...,...,...,...
541675,581538,22068,BLACK PIRATE TREASURE CHEST,1,12/9/2011 11:34,0.39,14446.0,United Kingdom
541689,581538,23318,BOX OF 6 MINI VINTAGE CRACKERS,1,12/9/2011 11:34,2.49,14446.0,United Kingdom
541692,581538,22992,REVOLVER WOODEN RULER,1,12/9/2011 11:34,1.95,14446.0,United Kingdom
541699,581538,22694,WICKER STAR,1,12/9/2011 11:34,2.10,14446.0,United Kingdom
541701,581538,23343,JUMBO BAG VINTAGE CHRISTMAS,1,12/9/2011 11:34,2.08,14446.0,United Kingdom

In [27]:
df[df.duplicated()].shape[0]

5268

In [31]:
# find out stocks which are more than 10 quantity and are from United Kingdom
df[(df['Quantity'] >= 10) & (df['Country'] == 'United Kingdom')]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
9,536367,84879,ASSORTED COLOUR BIRD ORNAMENT,32,12/1/2010 8:34,1.69,13047.0,United Kingdom
46,536371,22086,PAPER CHAIN KIT 50'S CHRISTMAS,80,12/1/2010 9:00,2.55,13748.0,United Kingdom
65,536374,21258,VICTORIAN SEWING BOX LARGE,32,12/1/2010 9:09,10.95,15100.0,United Kingdom
82,536376,22114,HOT WATER BOTTLE TEA AND SYMPATHY,48,12/1/2010 9:32,3.45,15291.0,United Kingdom
83,536376,21733,RED HANGING HEART T-LIGHT HOLDER,64,12/1/2010 9:32,2.55,15291.0,United Kingdom
...,...,...,...,...,...,...,...,...
541888,581585,23145,ZINC T-LIGHT HOLDER STAR LARGE,12,12/9/2011 12:31,0.95,15804.0,United Kingdom
541889,581585,22466,FAIRY TALE COTTAGE NIGHT LIGHT,12,12/9/2011 12:31,1.95,15804.0,United Kingdom
541891,581586,23275,SET OF 3 HANGING OWLS OLLIE BEAK,24,12/9/2011 12:49,1.25,13113.0,United Kingdom
541892,581586,21217,RED RETROSPOT ROUND CAKE TINS,24,12/9/2011 12:49,8.95,13113.0,United Kingdom
541893,581586,20685,DOORMAT RED RETROSPOT,10,12/9/2011 12:49,7.08,13113.0,United Kingdom

In [34]:
# Total Sales per Invoice 
df['Total_Sales'] = df['Quantity'] * df['UnitPrice']
df.groupby('InvoiceNo')['Total_Sales'].sum().reset_index()

      InvoiceNo  Total_Sales
0        536365       139.12
1        536366        22.20
2        536367       278.73
3        536368        70.05
4        536369        17.85
...         ...          ...
25895   C581484   -168469.60
25896   C581490       -32.53
25897   C581499      -224.69
25898   C581568       -54.75
25899   C581569        -7.50

[25900 rows x 2 columns]

In [35]:
df.head(2)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Total_Sales
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom,15.30
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,20.34

In [40]:
#Find the top 5 products by total quantity sold.
df.groupby('Description')['Quantity'].sum().reset_index().sort_values(by = 'Quantity', ascending = False).head()

                            Description  Quantity
4009  WORLD WAR 2 GLIDERS ASSTD DESIGNS     53847
1866            JUMBO BAG RED RETROSPOT     47363
244       ASSORTED COLOUR BIRD ORNAMENT     36381
2740                     POPCORN HOLDER     36334
2395    PACK OF 72 RETROSPOT CAKE CASES     36039

In [47]:
# Total Revenue by Country - Aggregate total sales by Country and sort them in descending order.
df.groupby('Country')['Total_Sales'].sum().sort_values(ascending = False).reset_index()

                 Country  Total_Sales
0         United Kingdom  8187806.364
1            Netherlands   284661.540
2                   EIRE   263276.820
3                Germany   221698.210
4                 France   197403.900
5              Australia   137077.270
6            Switzerland    56385.350
7                  Spain    54774.580
8                Belgium    40910.960
9                 Sweden    36595.910
10                 Japan    35340.620
11                Norway    35163.460
12              Portugal    29367.020
13               Finland    22326.740
14       Channel Islands    20086.290
15               Denmark    18768.140
16                 Italy    16890.510
17                Cyprus    12946.290
18               Austria    10154.320
19             Hong Kong    10117.040
20             Singapore     9120.390
21                Israel     7907.820
22                Poland     7213.140
23           Unspecified     4749.790
24                Greece     4710.520
25               Iceland     4310.000
26                Canada     3666.380
27                 Malta     2505.470
28  United Arab Emirates     1902.280
29                   USA     1730.920
30               Lebanon     1693.880
31             Lithuania     1661.060
32    European Community     1291.750
33                Brazil     1143.600
34                   RSA     1002.310
35        Czech Republic      707.720
36               Bahrain      548.400
37          Saudi Arabia      131.170

In [53]:
# Average Basket Value - Calculate the average amount per invoice. - total revenue divided by number of invoices

total_sum = df['Total_Sales'].sum()
total_invoice = df['InvoiceNo'].count()

print('average amount per invoice is ', total_sum/total_invoice)

average amount per invoice 17.98779487699964

In [58]:
# For each product (StockCode), compute: Total quantity sold, Total revenue, Average unit price

df.groupby(['StockCode','Description']).agg(Total_Quantity_Sold = ('Quantity', 'sum'),
                              Total_Revenue = ('Total_Sales', 'sum'),
                               Average_Unit_Price = ('UnitPrice', 'mean')
)

                                                 Total_Quantity_Sold  \
StockCode    Description
10002        INFLATABLE POLITICAL GLOBE                          860
             WHITE HANGING HEART T-LIGHT HOLDER                  177
10080        GROOVY CACTUS INFLATABLE                            303
             WHITE HANGING HEART T-LIGHT HOLDER                  170
             check                                                22
...                                                              ...
gift_0001_30 Dotcomgiftshop Gift Voucher £30.00                    7
             WHITE HANGING HEART T-LIGHT HOLDER                   30
gift_0001_40 Dotcomgiftshop Gift Voucher £40.00                    3
gift_0001_50 Dotcomgiftshop Gift Voucher £50.00                    4
m            Manual                                                1

                                                 Total_Revenue  \
StockCode    Description
10002        INFLATABLE POLITICAL GLOBE                 759.89
             WHITE HANGING HEART T-LIGHT HOLDER           0.00
10080        GROOVY CACTUS INFLATABLE                   119.09
             WHITE HANGING HEART T-LIGHT HOLDER           0.00
             check                                        0.00
...                                                        ...
gift_0001_30 Dotcomgiftshop Gift Voucher £30.00         175.53
             WHITE HANGING HEART T-LIGHT HOLDER           0.00
gift_0001_40 Dotcomgiftshop Gift Voucher £40.00         100.70
gift_0001_50 Dotcomgiftshop Gift Voucher £50.00         167.56
m            Manual                                       2.55

                                                 Average_Unit_Price
StockCode    Description
10002        INFLATABLE POLITICAL GLOBE                    1.086620
             WHITE HANGING HEART T-LIGHT HOLDER            0.000000
10080        GROOVY CACTUS INFLATABLE                      0.410909
             WHITE HANGING HEART T-LIGHT HOLDER            0.000000
             check                                         0.000000
...                                                             ...
gift_0001_30 Dotcomgiftshop Gift Voucher £30.00           25.075714
             WHITE HANGING HEART T-LIGHT HOLDER            0.000000
gift_0001_40 Dotcomgiftshop Gift Voucher £40.00           33.566667
gift_0001_50 Dotcomgiftshop Gift Voucher £50.00           41.890000
m            Manual                                        2.550000

[5752 rows x 3 columns]

In [59]:
df.head(5)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Total_Sales
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom,15.30
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom,22.00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,20.34
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,20.34

In [65]:
df['datetime'] = pd.to_datetime(df['InvoiceDate'])

In [66]:
df.head(1)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Total_Sales,datetime
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom,15.3,2010-12-01 08:26:00

In [68]:
df['time'] = df['datetime'].dt.time

In [69]:
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Total_Sales,datetime,time
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom,15.30,2010-12-01 08:26:00,08:26:00
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,20.34,2010-12-01 08:26:00,08:26:00
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom,22.00,2010-12-01 08:26:00,08:26:00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,20.34,2010-12-01 08:26:00,08:26:00
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,20.34,2010-12-01 08:26:00,08:26:00

In [72]:
# Find at what time of the day most orders are placed.
df.groupby('time')['StockCode'].count().sort_values(ascending = False).reset_index()

         time  StockCode
0    15:56:00       2628
1    14:41:00       2554
2    15:17:00       2376
3    16:14:00       2372
4    14:09:00       2172
..        ...        ...
769  07:46:00          1
770  06:12:00          1
771  19:06:00          1
772  19:41:00          1
773  06:10:00          1

[774 rows x 2 columns]

In [75]:
#country with most unique customers
df.groupby('Country')['CustomerID'].nunique().sort_values(ascending = False).reset_index()

                 Country  CustomerID
0         United Kingdom        3950
1                Germany          95
2                 France          87
3                  Spain          31
4                Belgium          25
5            Switzerland          21
6               Portugal          19
7                  Italy          15
8                Finland          12
9                Austria          11
10                Norway          10
11           Netherlands           9
12             Australia           9
13       Channel Islands           9
14               Denmark           9
15                Cyprus           8
16                Sweden           8
17                 Japan           8
18                Poland           6
19                   USA           4
20                Canada           4
21           Unspecified           4
22                Israel           4
23                Greece           4
24                  EIRE           3
25                 Malta           2
26  United Arab Emirates           2
27               Bahrain           2
28             Lithuania           1
29        Czech Republic           1
30               Lebanon           1
31                   RSA           1
32          Saudi Arabia           1
33             Singapore           1
34               Iceland           1
35                Brazil           1
36    European Community           1
37             Hong Kong           0

In [89]:
# Most Popular Product per Country (by revenue)
df.groupby(['Country', 'Description'], as_index=False).agg(Total_Sales=('Total_Sales', 'sum')).sort_values(['Country', 'Total_Sales'], ascending=[True, False]).drop_duplicates(subset = ['Country'], keep='first')

                    Country                          Description  Total_Sales
377               Australia                   RABBIT NIGHT LIGHT      3375.84
812                 Austria                              POSTAGE      1456.00
921                 Bahrain           ICE CREAM SUNDAE LIP GLOSS       120.00
1409                Belgium                              POSTAGE      4248.00
1742                 Brazil             REGENCY CAKESTAND 3 TIER       175.20
1835                 Canada                              POSTAGE       550.94
2209        Channel Islands             REGENCY CAKESTAND 3 TIER       517.80
2696                 Cyprus   RUSTIC  SEVENTEEN DRAWER SIDEBOARD       580.00
2847         Czech Republic  ROUND SNACK BOXES SET OF4 WOODLAND         70.80
3018                Denmark                   RED KITCHEN SCALES       734.40
4539                   EIRE             REGENCY CAKESTAND 3 TIER      7442.85
5161     European Community                              POSTAGE       141.00
5477                Finland                              POSTAGE      3472.00
6626                 France                              POSTAGE     15065.00
8298                Germany                              POSTAGE     20821.00
9006                 Greece                              POSTAGE       285.00
9101              Hong Kong      CHILDRENS CUTLERY POLKADOT PINK       398.40
9249                Iceland         3D DOG PICTURE PLAYING CARDS       371.70
9519                 Israel             REGENCY CAKESTAND 3 TIER       551.10
9925                  Italy                              POSTAGE      1645.00
10220                 Japan                   RABBIT NIGHT LIGHT      6087.79
10335               Lebanon             REGENCY CAKESTAND 3 TIER       153.00
10369             Lithuania   GREY FLORAL FELTCRAFT SHOULDER BAG       135.00
10442                 Malta                              POSTAGE       525.00
11005           Netherlands                   RABBIT NIGHT LIGHT      9568.48
11658                Norway                              POSTAGE      2870.50
12010                Poland                              POSTAGE       360.00
12526              Portugal                              POSTAGE      2508.00
12808                   RSA  CLASSIC METAL BIRDCAGE PLANT HOLDER        38.25
12862          Saudi Arabia       PLASTERS IN TIN CIRCUS PARADE         19.80
12907             Singapore                   DOORMAT UNION FLAG       340.80
13743                 Spain                              POSTAGE      5852.00
14272                Sweden              MINI PAINT SET VINTAGE       1895.40
15049           Switzerland                              POSTAGE      3880.00
15515                   USA   SET 6 SCHOOL MILK BOTTLES IN CRATE       162.72
15608  United Arab Emirates             REGENCY CAKESTAND 3 TIER       153.00
16723        United Kingdom                       DOTCOM POSTAGE    206245.48
19969           Unspecified             JAM MAKING SET WITH JARS        70.50